class Product {
  final int id;
  final int price;
  final String title, date;
  final String image;
  final String description;
  final double longitude;
  final double latitude;
  Product({
    this.id,
    this.title,
    this.price,
    this.date,
    this.image,
    this.description,
    this.latitude,
    this.longitude,
  });
}

List<Product> products = [
  Product(
    id: 1,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://91.img.avito.st/640x480/5485133491.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка! Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличРазумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: налич",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 2,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://20.img.avito.st/640x480/9803690620.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 3,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image:
        "https://73.img.avito.st/image/1/YHAyyraQzJkEYw6cfqc0TrppyJ2A6cRbg2nMl4ZFuezzR6_t7R2htfYc4fr2Hae25Ry69IJjzJOE",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 4,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image:
        "https://69.img.avito.st/image/1/vGvwybaQEILGYNKHhJ-OVnhqFIZC6hhAQWoQjERGZfcxRHP2Lx59rjQfPeE0HnutJx9m70BgEIhG",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 5,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://89.img.avito.st/640x480/11098694389.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 6,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://06.img.avito.st/640x480/5570005006.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 7,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://76.img.avito.st/640x480/11058164776.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 8,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://76.img.avito.st/640x480/11058164776.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 9,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://76.img.avito.st/640x480/11058164776.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 10,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://76.img.avito.st/640x480/11058164776.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 11,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://76.img.avito.st/640x480/11058164776.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 12,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://76.img.avito.st/640x480/11058164776.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
  Product(
    id: 13,
    title: "Chess доска",
    price: 3500,
    date: "25.05.2021",
    image: "https://76.img.avito.st/640x480/11058164776.jpg",
    description:
        "Разумные цены. Звоните. Заявки принимаются 24 часа. Без выходных. Все подробности по телефону. По ценам можно договорится! Звоните, уточняйте, ответим на интересующие вас вопросы, подберем для вас подходящие варианты! Любая форма оплаты: наличными, перевод на карту банка. Постоянным клиентам скидка!",
    latitude: 50.2963468,
    longitude: 57.1715153,
  ),
];
